TKXB/iotsploit-usb/examples/esp32s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# FreeRTOS tick 1kHz,便于 tud_task 轮询
CONFIG_FREERTOS_HZ=1000
# 关掉 USB 控制台,USB-OTG 专供 USBTMC
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# ---- BLE(NimBLE 主机栈,仅扫描)----
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# ---- 固件变大:单 APP 大分区表 ----
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# ---- 主任务栈:WiFi + NimBLE 初始化需要更大栈 ----
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
